blog/content/post/ai-deep-learning.org
+++
title = "03 - AI Engineering from scratch: do perceptron ao debug de rede neural"
description = "Como uma rede neural aprende de verdade, peça por peça, com código Python que você pode rodar"
date = 2026-05-25T17:00:00-03:00
tags = ["AI", "deep-learning", "pytorch", "backpropagation", "neural-networks", "python"]
draft = true
weight = 1
author = "Vitor Lobo Ramos"
+++


Deep learning parece mágica. Você joga dados num buraco negro de matrizes, espera alguns minutos (ou dias) e sai um modelo que reconhece gatos, traduz idiomas e escreve código. Mas não é mágica. São 13 peças que se encaixam, e quando você entende cada uma, o buraco negro vira um mecanismo de relógio.

Este artigo percorre essas 13 peças. Do perceptron (um único neurônio que decide sim ou não) até um framework completo de deep learning em 500 linhas. Depois conecta com PyTorch, dá uma olhada no JAX e fecha com o capítulo mais importante e mais ignorado: como debugar uma rede neural quando ela falha sem dar erro.

A stack aqui é Python + Go: Python pra treinar (PyTorch), Go pra servir (inferência em produção). O que você vai ver de código é Python, mas toda a lógica se aplica a qualquer framework.

* A anatomia de uma rede neural

Uma rede neural é uma função matemática com milhares (ou bilhões) de parâmetros ajustáveis. O treino é o processo de encontrar os valores desses parâmetros que minimizam o erro nas predições. Três ideias bastam pra entender como isso funciona.

** O perceptron: o tijolo fundamental**

O perceptron é o modelo mais simples possível. Ele recebe entradas (~x₁, x₂, ..., x_n~), multiplica cada uma por um peso (~wᵢ~), soma tudo, adiciona um viés (~b~) e passa por uma função de ativação. Se o resultado passar de um limiar, é classe A; senão, classe B.

#+BEGIN_SRC python
import numpy as np

def perceptron_predict(x, w, b):
    z = np.dot(w, x) + b
    return 1 if z >= 0 else 0

# Porta AND: só retorna 1 se ambas entradas forem 1
w_and = np.array([1.0, 1.0])
b_and = -1.5
print(perceptron_predict([1, 1], w_and, b_and))  # 1
print(perceptron_predict([0, 1], w_and, b_and))  # 0
#+END_SRC

O aprendizado é igualmente simples. Pra cada exemplo de treino, compare a predição com o valor real. Se errou, ajuste os pesos na direção do erro: ~w += lr * (y_true - y_pred) * x~. Esse loop converge pra qualquer problema /linearmente separável/.

O problema: o XOR não é. Tente desenhar uma reta que separe os pontos (0,0) e (1,1) [classe 0] dos pontos (0,1) e (1,0) [classe 1]. Impossível. Essa limitação quase matou as redes neurais nos anos 60.

A solução é empilhar perceptrons.

