ai-deep-learning/index.html
<!DOCTYPE html>
<html lang="pt-br">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <link rel="icon" href="data:,">
  <title>03 - AI Engineering from scratch: do perceptron ao debug de rede neural — lobovit</title>
  <link rel="stylesheet" href="/css/main.css?v=3">
  <link rel="stylesheet" href="/vendor/fonts/fonts.css">
  <link rel="stylesheet" href="/vendor/prism/prism-mocha.min.css">
</head>
<body>
  <div class="frame">
    <header>
      <nav>
        <a class="site-title" href="https://lobovit.github.io/">lobovit</a>
        <span class="nav-links">
          <a href="/page/about/">about</a>
          <a href="/page/contact/">contact</a>
        </span>
      </nav>
      <hr>
    </header>
    <main>
      
<article>
  <header>
    <h1>03 - AI Engineering from scratch: do perceptron ao debug de rede neural</h1>
    <p class="meta"><time>2026-05-25</time> · <span class="tag">AI</span><span class="tag">deep-learning</span><span class="tag">pytorch</span><span class="tag">backpropagation</span><span class="tag">neural-networks</span><span class="tag">python</span></p>
  </header>
  <div class="content">
    
<p>
Deep learning parece mágica. Você joga dados num buraco negro de matrizes, espera alguns minutos (ou dias) e sai um modelo que reconhece gatos, traduz idiomas e escreve código. Mas não é mágica. São 13 peças que se encaixam, e quando você entende cada uma, o buraco negro vira um mecanismo de relógio.</p>
<p>
Este artigo percorre essas 13 peças. Do perceptron (um único neurônio que decide sim ou não) até um framework completo de deep learning em 500 linhas. Depois conecta com PyTorch, dá uma olhada no JAX e fecha com o capítulo mais importante e mais ignorado: como debugar uma rede neural quando ela falha sem dar erro.</p>
<p>
A stack aqui é Python + Go: Python pra treinar (PyTorch), Go pra servir (inferência em produção). O que você vai ver de código é Python, mas toda a lógica se aplica a qualquer framework.</p>
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
A anatomia de uma rede neural
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>
Uma rede neural é uma função matemática com milhares (ou bilhões) de parâmetros ajustáveis. O treino é o processo de encontrar os valores desses parâmetros que minimizam o erro nas predições. Três ideias bastam pra entender como isso funciona.</p>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
O perceptron: o tijolo fundamental**
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>
O perceptron é o modelo mais simples possível. Ele recebe entradas (<code>x₁, x₂, ..., x_n</code>), multiplica cada uma por um peso (<code>wᵢ</code>), soma tudo, adiciona um viés (<code>b</code>) e passa por uma função de ativação. Se o resultado passar de um limiar, é classe A; senão, classe B.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">perceptron_predict</span><span class="p">(</span><span class="n">x</span><span class="p">,</span> <span class="n">w</span><span class="p">,</span> <span class="n">b</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">z</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">dot</span><span class="p">(</span><span class="n">w</span><span class="p">,</span> <span class="n">x</span><span class="p">)</span> <span class="o">+</span> <span class="n">b</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="mi">1</span> <span class="k">if</span> <span class="n">z</span> <span class="o">&gt;=</span> <span class="mi">0</span> <span class="k">else</span> <span class="mi">0</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Porta AND: só retorna 1 se ambas entradas forem 1</span>
</span></span><span class="line"><span class="cl"><span class="n">w_and</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mf">1.0</span><span class="p">,</span> <span class="mf">1.0</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="n">b_and</span> <span class="o">=</span> <span class="o">-</span><span class="mf">1.5</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">perceptron_predict</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span> <span class="mi">1</span><span class="p">],</span> <span class="n">w_and</span><span class="p">,</span> <span class="n">b_and</span><span class="p">))</span>  <span class="c1"># 1</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="n">perceptron_predict</span><span class="p">([</span><span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">],</span> <span class="n">w_and</span><span class="p">,</span> <span class="n">b_and</span><span class="p">))</span>  <span class="c1"># 0</span></span></span></code></pre></div>
</div>
<p>
O aprendizado é igualmente simples. Pra cada exemplo de treino, compare a predição com o valor real. Se errou, ajuste os pesos na direção do erro: <code>w += lr * (y_true - y_pred) * x</code>. Esse loop converge pra qualquer problema <em>linearmente separável</em>.</p>
<p>
O problema: o XOR não é. Tente desenhar uma reta que separe os pontos (0,0) e (1,1) [classe 0] dos pontos (0,1) e (1,0) [classe 1]. Impossível. Essa limitação quase matou as redes neurais nos anos 60.</p>
<p>
A solução é empilhar perceptrons.</p>
</div>
</div>
