blog/content/post/ai-deep-learning.org
** Camadas escondidas e o forward pass**

Uma rede com camada escondida resolve o XOR. A ideia: a primeira camada transforma o espaço de entrada num espaço onde os pontos /são/ linearmente separáveis. A segunda camada (de saída) faz a classificação final nesse novo espaço.

O forward pass é a computação da esquerda pra direita: ~a¹ = σ(W¹x + b¹); a² = σ(W²a¹ + b²); ...~. Cada ~W~ é uma matriz de pesos entre camadas. Cada ~σ~ é uma função de ativação não-linear (sigmoid, ReLU, GELU, dependendo da arquitetura). Sem a não-linearidade, 100 camadas colapsam numa única multiplicação de matriz, porque linear de linear é linear.

#+BEGIN_SRC python
import numpy as np

def sigmoid(x):
    return 1 / (1 + np.exp(-x))

# XOR com uma camada escondida de 2 neurônios
W1 = np.array([[20, 20], [-20, -20]])   # (2,2)
b1 = np.array([-10, 30])                 # (2,)
W2 = np.array([[20, 20]])                # (1,2)
b2 = np.array([-30])                     # (1,)

def xor_forward(x):
    h = sigmoid(W1 @ x + b1)
    return sigmoid(W2 @ h + b2)

for x in [[0,0], [0,1], [1,0], [1,1]]:
    print(f"{x} -> {xor_forward(x):.4f}")
#+END_SRC

O Teorema da Aproximação Universal diz que uma rede com uma única camada escondida e neurônios suficientes pode aproximar qualquer função contínua. Na prática, redes profundas (muitas camadas) são mais eficientes que redes largas (poucas camadas com muitos neurônios). O GPT-3 tem 96 camadas; o GPT-4, mais de 120.

** Backpropagation: como o modelo descobre o que ajustar**

O forward pass computa predições. O backward pass (backpropagation) computa gradientes. É o algoritmo que tornou deep learning viável, reduzindo o que seria 2.3 milhões de ajustes manuais de peso a uma única passada de trás pra frente.

A regra da cadeia aplicada em reverso. Pra cada camada, a partir da saída: calcule o gradiente da loss em relação aos pesos da camada, depois propague o gradiente pra camada anterior. O gradiente de uma camada depende do gradiente da camada seguinte. Isso é retropropagação.

#+BEGIN_SRC python
# Derivada da sigmoid: s(x) * (1 - s(x))
def sigmoid_derivative(x):
    s = sigmoid(x)
    return s * (1 - s)

# Backprop manual simplificado: loss MSE, uma saída
def backward_pass(x, y, W1, b1, W2, b2):
    # Forward
    z1 = W1 @ x + b1
    a1 = sigmoid(z1)
    z2 = W2 @ a1 + b2
    a2 = sigmoid(z2)

    # Backward (da saída pra entrada)
    d_loss = 2 * (a2 - y)                        # gradiente da MSE
    d_z2 = d_loss * sigmoid_derivative(z2)
    d_W2 = np.outer(d_z2, a1)                    # gradiente dos pesos W2
    d_b2 = d_z2
    d_a1 = W2.T @ d_z2
    d_z1 = d_a1 * sigmoid_derivative(z1)
    d_W1 = np.outer(d_z1, x)                     # gradiente dos pesos W1
    d_b1 = d_z1

    return d_W1, d_b1, d_W2, d_b2, a2
#+END_SRC

O problema do vanishing gradient: a derivada da sigmoid no ponto de saturação é quase zero (máximo de 0.25). Depois de 10 camadas, o gradiente que chega na primeira é no máximo ~0.25^10 ≈ 1e-6~. As camadas iniciais simplesmente param de aprender. A ReLU resolve isso: gradiente é 1 pra valores positivos, sem saturação.

No PyTorch, ~loss.backward()~ faz tudo isso automaticamente. Mas entender o que acontece por baixo é o que te permite debugar quando algo some.

