ai-deep-learning/index.html
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Camadas escondidas e o forward pass**
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>
Uma rede com camada escondida resolve o XOR. A ideia: a primeira camada transforma o espaço de entrada num espaço onde os pontos <em>são</em> linearmente separáveis. A segunda camada (de saída) faz a classificação final nesse novo espaço.</p>
<p>
O forward pass é a computação da esquerda pra direita: <code>a¹ = σ(W¹x + b¹); a² = σ(W²a¹ + b²); ...</code>. Cada <code>W</code> é uma matriz de pesos entre camadas. Cada <code>σ</code> é uma função de ativação não-linear (sigmoid, ReLU, GELU, dependendo da arquitetura). Sem a não-linearidade, 100 camadas colapsam numa única multiplicação de matriz, porque linear de linear é linear.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">sigmoid</span><span class="p">(</span><span class="n">x</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="mi">1</span> <span class="o">/</span> <span class="p">(</span><span class="mi">1</span> <span class="o">+</span> <span class="n">np</span><span class="o">.</span><span class="n">exp</span><span class="p">(</span><span class="o">-</span><span class="n">x</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># XOR com uma camada escondida de 2 neurônios</span>
</span></span><span class="line"><span class="cl"><span class="n">W1</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([[</span><span class="mi">20</span><span class="p">,</span> <span class="mi">20</span><span class="p">],</span> <span class="p">[</span><span class="o">-</span><span class="mi">20</span><span class="p">,</span> <span class="o">-</span><span class="mi">20</span><span class="p">]])</span>   <span class="c1"># (2,2)</span>
</span></span><span class="line"><span class="cl"><span class="n">b1</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="o">-</span><span class="mi">10</span><span class="p">,</span> <span class="mi">30</span><span class="p">])</span>                 <span class="c1"># (2,)</span>
</span></span><span class="line"><span class="cl"><span class="n">W2</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([[</span><span class="mi">20</span><span class="p">,</span> <span class="mi">20</span><span class="p">]])</span>                <span class="c1"># (1,2)</span>
</span></span><span class="line"><span class="cl"><span class="n">b2</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="o">-</span><span class="mi">30</span><span class="p">])</span>                     <span class="c1"># (1,)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">xor_forward</span><span class="p">(</span><span class="n">x</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">h</span> <span class="o">=</span> <span class="n">sigmoid</span><span class="p">(</span><span class="n">W1</span> <span class="o">@</span> <span class="n">x</span> <span class="o">+</span> <span class="n">b1</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">sigmoid</span><span class="p">(</span><span class="n">W2</span> <span class="o">@</span> <span class="n">h</span> <span class="o">+</span> <span class="n">b2</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">for</span> <span class="n">x</span> <span class="ow">in</span> <span class="p">[[</span><span class="mi">0</span><span class="p">,</span><span class="mi">0</span><span class="p">],</span> <span class="p">[</span><span class="mi">0</span><span class="p">,</span><span class="mi">1</span><span class="p">],</span> <span class="p">[</span><span class="mi">1</span><span class="p">,</span><span class="mi">0</span><span class="p">],</span> <span class="p">[</span><span class="mi">1</span><span class="p">,</span><span class="mi">1</span><span class="p">]]:</span>
</span></span><span class="line"><span class="cl">    <span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;</span><span class="si">{</span><span class="n">x</span><span class="si">}</span><span class="s2"> -&gt; </span><span class="si">{</span><span class="n">xor_forward</span><span class="p">(</span><span class="n">x</span><span class="p">)</span><span class="si">:</span><span class="s2">.4f</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span></span></span></code></pre></div>
</div>
<p>
O Teorema da Aproximação Universal diz que uma rede com uma única camada escondida e neurônios suficientes pode aproximar qualquer função contínua. Na prática, redes profundas (muitas camadas) são mais eficientes que redes largas (poucas camadas com muitos neurônios). O GPT-3 tem 96 camadas; o GPT-4, mais de 120.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Backpropagation: como o modelo descobre o que ajustar**
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>
O forward pass computa predições. O backward pass (backpropagation) computa gradientes. É o algoritmo que tornou deep learning viável, reduzindo o que seria 2.3 milhões de ajustes manuais de peso a uma única passada de trás pra frente.</p>
<p>
A regra da cadeia aplicada em reverso. Pra cada camada, a partir da saída: calcule o gradiente da loss em relação aos pesos da camada, depois propague o gradiente pra camada anterior. O gradiente de uma camada depende do gradiente da camada seguinte. Isso é retropropagação.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="c1"># Derivada da sigmoid: s(x) * (1 - s(x))</span>
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">sigmoid_derivative</span><span class="p">(</span><span class="n">x</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">s</span> <span class="o">=</span> <span class="n">sigmoid</span><span class="p">(</span><span class="n">x</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">s</span> <span class="o">*</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="n">s</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="c1"># Backprop manual simplificado: loss MSE, uma saída</span>
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">backward_pass</span><span class="p">(</span><span class="n">x</span><span class="p">,</span> <span class="n">y</span><span class="p">,</span> <span class="n">W1</span><span class="p">,</span> <span class="n">b1</span><span class="p">,</span> <span class="n">W2</span><span class="p">,</span> <span class="n">b2</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="c1"># Forward</span>
</span></span><span class="line"><span class="cl">    <span class="n">z1</span> <span class="o">=</span> <span class="n">W1</span> <span class="o">@</span> <span class="n">x</span> <span class="o">+</span> <span class="n">b1</span>
</span></span><span class="line"><span class="cl">    <span class="n">a1</span> <span class="o">=</span> <span class="n">sigmoid</span><span class="p">(</span><span class="n">z1</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">z2</span> <span class="o">=</span> <span class="n">W2</span> <span class="o">@</span> <span class="n">a1</span> <span class="o">+</span> <span class="n">b2</span>
</span></span><span class="line"><span class="cl">    <span class="n">a2</span> <span class="o">=</span> <span class="n">sigmoid</span><span class="p">(</span><span class="n">z2</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="c1"># Backward (da saída pra entrada)</span>
</span></span><span class="line"><span class="cl">    <span class="n">d_loss</span> <span class="o">=</span> <span class="mi">2</span> <span class="o">*</span> <span class="p">(</span><span class="n">a2</span> <span class="o">-</span> <span class="n">y</span><span class="p">)</span>                        <span class="c1"># gradiente da MSE</span>
</span></span><span class="line"><span class="cl">    <span class="n">d_z2</span> <span class="o">=</span> <span class="n">d_loss</span> <span class="o">*</span> <span class="n">sigmoid_derivative</span><span class="p">(</span><span class="n">z2</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">d_W2</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">outer</span><span class="p">(</span><span class="n">d_z2</span><span class="p">,</span> <span class="n">a1</span><span class="p">)</span>                    <span class="c1"># gradiente dos pesos W2</span>
</span></span><span class="line"><span class="cl">    <span class="n">d_b2</span> <span class="o">=</span> <span class="n">d_z2</span>
</span></span><span class="line"><span class="cl">    <span class="n">d_a1</span> <span class="o">=</span> <span class="n">W2</span><span class="o">.</span><span class="n">T</span> <span class="o">@</span> <span class="n">d_z2</span>
</span></span><span class="line"><span class="cl">    <span class="n">d_z1</span> <span class="o">=</span> <span class="n">d_a1</span> <span class="o">*</span> <span class="n">sigmoid_derivative</span><span class="p">(</span><span class="n">z1</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">d_W1</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">outer</span><span class="p">(</span><span class="n">d_z1</span><span class="p">,</span> <span class="n">x</span><span class="p">)</span>                     <span class="c1"># gradiente dos pesos W1</span>
</span></span><span class="line"><span class="cl">    <span class="n">d_b1</span> <span class="o">=</span> <span class="n">d_z1</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">d_W1</span><span class="p">,</span> <span class="n">d_b1</span><span class="p">,</span> <span class="n">d_W2</span><span class="p">,</span> <span class="n">d_b2</span><span class="p">,</span> <span class="n">a2</span></span></span></code></pre></div>
</div>
<p>
O problema do vanishing gradient: a derivada da sigmoid no ponto de saturação é quase zero (máximo de 0.25). Depois de 10 camadas, o gradiente que chega na primeira é no máximo <code>0.25^10 ≈ 1e-6</code>. As camadas iniciais simplesmente param de aprender. A ReLU resolve isso: gradiente é 1 pra valores positivos, sem saturação.</p>
<p>
No PyTorch, <code>loss.backward()</code> faz tudo isso automaticamente. Mas entender o que acontece por baixo é o que te permite debugar quando algo some.</p>
</div>
</div>
</div>
</div>
