blog/content/post/ai-deep-learning.org
* As engrenagens do treino

Uma rede neural é definida por quatro escolhas interligadas. A função de ativação decide se o sinal passa. A função de perda define o que "erro" significa. O otimizador decide como corrigir o erro. E o learning rate controla a velocidade da correção.

** Ativações: o que faz o sinal passar (ou não)**

Sem ativação não-linear, 100 camadas de ~Wx + b~ colapsam em ~W_equivalente * x + b_equivalente~. A não-linearidade é o que permite à rede aprender fronteiras curvas.

A sigmoid (~σ(x) = 1/(1+e^(-x))~) foi a primeira. Suave, derivada fácil, output entre 0 e 1. Caiu em desuso porque satura (gradiente ~0 nos extremos). A tanh (~(e^x - e^(-x))/(e^x + e^(-x))~) é a sigmoid centralizada no zero: output entre -1 e 1, gradientes mais fortes.

A ReLU (~max(0, x)~) dominou por uma década. Simples, rápida, sem saturação pra valores positivos. O problema: se um neurônio só recebe entradas negativas, ele morre (gradiente zero pra sempre, nunca mais atualiza). É o "dying ReLU".

A GELU (~x * Φ(x)~, onde Φ é a CDF da normal) é a ativação padrão dos transformers modernos (BERT, GPT). Ela suaviza a ReLU multiplicando por uma probabilidade, o que produz gradientes mais estáveis em redes profundas. A Swish (~x * σ(x)~) é similar e foi descoberta por busca de arquitetura.

#+BEGIN_SRC python
import numpy as np

def relu(x):       return np.maximum(0, x)
def leaky_relu(x): return np.where(x > 0, x, 0.01 * x)
def gelu(x):       return 0.5 * x * (1 + np.tanh(np.sqrt(2/np.pi) * (x + 0.044715 * x**3)))
def swish(x):      return x / (1 + np.exp(-x))

x = np.array([-2, -1, 0, 1, 2])
print("ReLU:     ", relu(x))         # [0, 0, 0, 1, 2]
print("GELU:     ", gelu(x).round(3))  # [-0.045, -0.159, 0, 0.841, 1.955]
#+END_SRC

A regra prática: transformers (NLP, LLMs) usam GELU. CNNs (visão) usam ReLU. RNNs usam tanh. Saída de classificação binária usa sigmoid; multiclasse usa softmax; regressão usa linear (sem ativação). Se neurônios estão morrendo numa ReLU, troque pra GELU, não pra LeakyReLU.

#+BEGIN_QUOTE
/Em miúdos:/ ~Saturação~ é quando a função de ativação achata nos extremos e a derivada vai pra zero. É como tentar descer uma ladeira que virou um platô: você não sabe mais pra onde ir. ~Neurônio morto~ é um neurônio ReLU que nunca mais dispara porque todos os inputs são negativos e o gradiente é zero. ~Softmax~ transforma um vetor de scores brutos (logits) numa distribuição de probabilidade que soma 1. É a última camada de todo classificador.
#+END_QUOTE

