ai-deep-learning/index.html
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
As engrenagens do treino
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>
Uma rede neural é definida por quatro escolhas interligadas. A função de ativação decide se o sinal passa. A função de perda define o que &#34;erro&#34; significa. O otimizador decide como corrigir o erro. E o learning rate controla a velocidade da correção.</p>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Ativações: o que faz o sinal passar (ou não)**
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
Sem ativação não-linear, 100 camadas de <code>Wx + b</code> colapsam em <code>W_equivalente * x + b_equivalente</code>. A não-linearidade é o que permite à rede aprender fronteiras curvas.</p>
<p>
A sigmoid (<code>σ(x) = 1/(1+e^(-x))</code>) foi a primeira. Suave, derivada fácil, output entre 0 e 1. Caiu em desuso porque satura (gradiente <code>0 nos extremos). A tanh (~(e^x - e^(-x))/(e^x + e^(-x))</code>) é a sigmoid centralizada no zero: output entre -1 e 1, gradientes mais fortes.</p>
<p>
A ReLU (<code>max(0, x)</code>) dominou por uma década. Simples, rápida, sem saturação pra valores positivos. O problema: se um neurônio só recebe entradas negativas, ele morre (gradiente zero pra sempre, nunca mais atualiza). É o &#34;dying ReLU&#34;.</p>
<p>
A GELU (<code>x * Φ(x)</code>, onde Φ é a CDF da normal) é a ativação padrão dos transformers modernos (BERT, GPT). Ela suaviza a ReLU multiplicando por uma probabilidade, o que produz gradientes mais estáveis em redes profundas. A Swish (<code>x * σ(x)</code>) é similar e foi descoberta por busca de arquitetura.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">relu</span><span class="p">(</span><span class="n">x</span><span class="p">):</span>       <span class="k">return</span> <span class="n">np</span><span class="o">.</span><span class="n">maximum</span><span class="p">(</span><span class="mi">0</span><span class="p">,</span> <span class="n">x</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">leaky_relu</span><span class="p">(</span><span class="n">x</span><span class="p">):</span> <span class="k">return</span> <span class="n">np</span><span class="o">.</span><span class="n">where</span><span class="p">(</span><span class="n">x</span> <span class="o">&gt;</span> <span class="mi">0</span><span class="p">,</span> <span class="n">x</span><span class="p">,</span> <span class="mf">0.01</span> <span class="o">*</span> <span class="n">x</span><span class="p">)</span>
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">gelu</span><span class="p">(</span><span class="n">x</span><span class="p">):</span>       <span class="k">return</span> <span class="mf">0.5</span> <span class="o">*</span> <span class="n">x</span> <span class="o">*</span> <span class="p">(</span><span class="mi">1</span> <span class="o">+</span> <span class="n">np</span><span class="o">.</span><span class="n">tanh</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="mi">2</span><span class="o">/</span><span class="n">np</span><span class="o">.</span><span class="n">pi</span><span class="p">)</span> <span class="o">*</span> <span class="p">(</span><span class="n">x</span> <span class="o">+</span> <span class="mf">0.044715</span> <span class="o">*</span> <span class="n">x</span><span class="o">**</span><span class="mi">3</span><span class="p">)))</span>
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">swish</span><span class="p">(</span><span class="n">x</span><span class="p">):</span>      <span class="k">return</span> <span class="n">x</span> <span class="o">/</span> <span class="p">(</span><span class="mi">1</span> <span class="o">+</span> <span class="n">np</span><span class="o">.</span><span class="n">exp</span><span class="p">(</span><span class="o">-</span><span class="n">x</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">x</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="o">-</span><span class="mi">2</span><span class="p">,</span> <span class="o">-</span><span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">,</span> <span class="mi">2</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="s2">&#34;ReLU:     &#34;</span><span class="p">,</span> <span class="n">relu</span><span class="p">(</span><span class="n">x</span><span class="p">))</span>         <span class="c1"># [0, 0, 0, 1, 2]</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="s2">&#34;GELU:     &#34;</span><span class="p">,</span> <span class="n">gelu</span><span class="p">(</span><span class="n">x</span><span class="p">)</span><span class="o">.</span><span class="n">round</span><span class="p">(</span><span class="mi">3</span><span class="p">))</span>  <span class="c1"># [-0.045, -0.159, 0, 0.841, 1.955]</span></span></span></code></pre></div>
</div>
<p>
A regra prática: transformers (NLP, LLMs) usam GELU. CNNs (visão) usam ReLU. RNNs usam tanh. Saída de classificação binária usa sigmoid; multiclasse usa softmax; regressão usa linear (sem ativação). Se neurônios estão morrendo numa ReLU, troque pra GELU, não pra LeakyReLU.</p>
<blockquote>
<p><em>Em miúdos:</em> <code>Saturação</code> é quando a função de ativação achata nos extremos e a derivada vai pra zero. É como tentar descer uma ladeira que virou um platô: você não sabe mais pra onde ir. <code>Neurônio morto</code> é um neurônio ReLU que nunca mais dispara porque todos os inputs são negativos e o gradiente é zero. <code>Softmax</code> transforma um vetor de scores brutos (logits) numa distribuição de probabilidade que soma 1. É a última camada de todo classificador.</p>
</blockquote>
</div>
</div>
