blog/content/post/ai-deep-learning.org
** Loss functions: o que o modelo tenta minimizar**

A loss é o único número que o modelo vê. Toda a complexidade do treino se resume a "faça esse número descer". Escolher a loss errada é como dar a bússola errada pro navegador.

MSE (~(pred - target)²~) é a loss de regressão. Suave, derivada contínua, penaliza erros grandes quadraticamente. Mas em classificação, MSE produz gradientes pequenos demais quando a predição está longe do alvo, o que significa aprendizado lento justo quando você mais precisa de correção.

Cross-entropy resolve isso. Pra classificação binária: ~BCE = -(y*log(p) + (1-y)*log(1-p))~. Quando o modelo erra feio (prevê 0.01 pra classe correta), o ~-log(0.01) = 4.6~ explode e o gradiente é enorme. É o equivalente matemático de "acorda, você errou muito".

Label smoothing troca o one-hot ~[0,0,1,0]~ por ~[0.01, 0.01, 0.97, 0.01]~. Isso impede overfitting e overconfidence. O GPT usa label smoothing. Focal loss adiciona um fator ~(1-p)^γ~ que reduz o peso de exemplos fáceis (já classificados corretamente), focando o treino nos difíceis. Essencial pra detecção de objetos com desbalanceamento de classes.

InfoNCE é a loss do aprendizado auto-supervisionado. Dado um par positivo (duas visões da mesma imagem) e N pares negativos (visões de imagens diferentes), minimize a distância do positivo e maximize a dos negativos. SimCLR e CLIP usam isso.

#+BEGIN_SRC python
import numpy as np

def bce_loss(y_true, y_pred):
    eps = 1e-12
    y_pred = np.clip(y_pred, eps, 1 - eps)
    return -np.mean(y_true * np.log(y_pred) + (1 - y_true) * np.log(1 - y_pred))

def label_smoothing(y_true, num_classes, alpha=0.1):
    one_hot = np.eye(num_classes)[y_true]
    return (1 - alpha) * one_hot + alpha / num_classes

y_true = np.array([1, 0, 1])
y_pred = np.array([0.9, 0.1, 0.2])
print(f"BCE dos erros: {bce_loss(y_true, y_pred):.4f}")  # alto: 0.2 está muito errado
#+END_SRC

