ai-deep-learning/index.html
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Loss functions: o que o modelo tenta minimizar**
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
A loss é o único número que o modelo vê. Toda a complexidade do treino se resume a &#34;faça esse número descer&#34;. Escolher a loss errada é como dar a bússola errada pro navegador.</p>
<p>
MSE (<code>(pred - target)²</code>) é a loss de regressão. Suave, derivada contínua, penaliza erros grandes quadraticamente. Mas em classificação, MSE produz gradientes pequenos demais quando a predição está longe do alvo, o que significa aprendizado lento justo quando você mais precisa de correção.</p>
<p>
Cross-entropy resolve isso. Pra classificação binária: <code>BCE = -(y*log(p) + (1-y)*log(1-p))</code>. Quando o modelo erra feio (prevê 0.01 pra classe correta), o <code>-log(0.01) = 4.6</code> explode e o gradiente é enorme. É o equivalente matemático de &#34;acorda, você errou muito&#34;.</p>
<p>
Label smoothing troca o one-hot <code>[0,0,1,0]</code> por <code>[0.01, 0.01, 0.97, 0.01]</code>. Isso impede overfitting e overconfidence. O GPT usa label smoothing. Focal loss adiciona um fator <code>(1-p)^γ</code> que reduz o peso de exemplos fáceis (já classificados corretamente), focando o treino nos difíceis. Essencial pra detecção de objetos com desbalanceamento de classes.</p>
<p>
InfoNCE é a loss do aprendizado auto-supervisionado. Dado um par positivo (duas visões da mesma imagem) e N pares negativos (visões de imagens diferentes), minimize a distância do positivo e maximize a dos negativos. SimCLR e CLIP usam isso.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">bce_loss</span><span class="p">(</span><span class="n">y_true</span><span class="p">,</span> <span class="n">y_pred</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">eps</span> <span class="o">=</span> <span class="mf">1e-12</span>
</span></span><span class="line"><span class="cl">    <span class="n">y_pred</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">clip</span><span class="p">(</span><span class="n">y_pred</span><span class="p">,</span> <span class="n">eps</span><span class="p">,</span> <span class="mi">1</span> <span class="o">-</span> <span class="n">eps</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="o">-</span><span class="n">np</span><span class="o">.</span><span class="n">mean</span><span class="p">(</span><span class="n">y_true</span> <span class="o">*</span> <span class="n">np</span><span class="o">.</span><span class="n">log</span><span class="p">(</span><span class="n">y_pred</span><span class="p">)</span> <span class="o">+</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="n">y_true</span><span class="p">)</span> <span class="o">*</span> <span class="n">np</span><span class="o">.</span><span class="n">log</span><span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="n">y_pred</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">label_smoothing</span><span class="p">(</span><span class="n">y_true</span><span class="p">,</span> <span class="n">num_classes</span><span class="p">,</span> <span class="n">alpha</span><span class="o">=</span><span class="mf">0.1</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">one_hot</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">eye</span><span class="p">(</span><span class="n">num_classes</span><span class="p">)[</span><span class="n">y_true</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="n">alpha</span><span class="p">)</span> <span class="o">*</span> <span class="n">one_hot</span> <span class="o">+</span> <span class="n">alpha</span> <span class="o">/</span> <span class="n">num_classes</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">y_true</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mi">1</span><span class="p">,</span> <span class="mi">0</span><span class="p">,</span> <span class="mi">1</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="n">y_pred</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">array</span><span class="p">([</span><span class="mf">0.9</span><span class="p">,</span> <span class="mf">0.1</span><span class="p">,</span> <span class="mf">0.2</span><span class="p">])</span>
</span></span><span class="line"><span class="cl"><span class="nb">print</span><span class="p">(</span><span class="sa">f</span><span class="s2">&#34;BCE dos erros: </span><span class="si">{</span><span class="n">bce_loss</span><span class="p">(</span><span class="n">y_true</span><span class="p">,</span> <span class="n">y_pred</span><span class="p">)</span><span class="si">:</span><span class="s2">.4f</span><span class="si">}</span><span class="s2">&#34;</span><span class="p">)</span>  <span class="c1"># alto: 0.2 está muito errado</span></span></span></code></pre></div>
</div>
</div>
</div>
