blog/content/post/ai-deep-learning.org
** Otimizadores: como o modelo se corrige**

O SGD puro (~w -= lr * grad~) é um compasso: aponta a direção mas não sabe nada sobre o terreno. Momentum (~v = β*v + grad; w -= lr*v~) adiciona inércia: continue andando na direção média, ignore oscilações.

Adam junta momentum com adaptação por parâmetro. Mantém duas médias móveis exponenciais: ~m~ (primeira momento, direção) e ~v~ (segundo momento, magnitude). Cada peso ganha sua própria taxa de aprendizado efetiva, inversamente proporcional à raiz da média dos gradientes ao quadrado. Isso faz o Adam ser robusto a gradientes com escalas diferentes, que é exatamente o que acontece em redes profundas (pesos das primeiras camadas têm gradientes ordens de magnitude menores que os das últimas).

AdamW é o Adam com weight decay desacoplado. No Adam original, weight decay e adaptação de learning rate se misturavam (o decay era aplicado ao gradiente, não ao peso). AdamW aplica ~w -= lr * λ * w~ separadamente, o que produz regularização mais forte e melhor generalização. Todo transformer moderno (BERT, GPT, LLaMA, Stable Diffusion) foi treinado com AdamW.

#+BEGIN_SRC python
class AdamW:
    def __init__(self, lr=1e-3, betas=(0.9, 0.999), eps=1e-8, weight_decay=0.01):
        self.lr, self.b1, self.b2, self.eps, self.wd = lr, *betas, eps, weight_decay
        self.m, self.v, self.t = {}, {}, 0

    def step(self, params, grads):
        self.t += 1
        for name in params:
            p, g = params[name], grads[name]
            self.m[name] = self.b1 * self.m.get(name, 0) + (1 - self.b1) * g
            self.v[name] = self.b2 * self.v.get(name, 0) + (1 - self.b2) * g**2
            m_hat = self.m[name] / (1 - self.b1**self.t)
            v_hat = self.v[name] / (1 - self.b2**self.t)
            params[name] = p - self.lr * (m_hat / (np.sqrt(v_hat) + self.eps) + self.wd * p)
#+END_SRC

#+BEGIN_QUOTE
/Em miúdos:/ ~Weight decay~ é a regularização L2: penalize pesos grandes pra evitar overfitting. ~Bias correction~ corrige o viés inicial do Adam: nas primeiras iterações, ~m~ e ~v~ começam em zero e demoram a aquecer; dividir por ~(1 - β^t)~ compensa isso. ~Beta1=0.9~ significa "lembre 90% do momentum passado"; ~beta2=0.999~ significa "lembre 99.9% da magnitude passada". ~Epsilon~ (1e-8) evita divisão por zero.
#+END_QUOTE

* Fazendo a rede aprender melhor

Os três ingredientes anteriores (ativação, loss, otimizador) são o motor. Os três seguintes são o volante: regularização impede overfitting, inicialização de pesos faz o motor pegar de primeira, e learning rate schedule controla a velocidade na curva.

