ai-deep-learning/index.html
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Otimizadores: como o modelo se corrige**
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<p>
O SGD puro (<code>w -= lr * grad</code>) é um compasso: aponta a direção mas não sabe nada sobre o terreno. Momentum (<code>v = β*v + grad; w -= lr*v</code>) adiciona inércia: continue andando na direção média, ignore oscilações.</p>
<p>
Adam junta momentum com adaptação por parâmetro. Mantém duas médias móveis exponenciais: <code>m</code> (primeira momento, direção) e <code>v</code> (segundo momento, magnitude). Cada peso ganha sua própria taxa de aprendizado efetiva, inversamente proporcional à raiz da média dos gradientes ao quadrado. Isso faz o Adam ser robusto a gradientes com escalas diferentes, que é exatamente o que acontece em redes profundas (pesos das primeiras camadas têm gradientes ordens de magnitude menores que os das últimas).</p>
<p>
AdamW é o Adam com weight decay desacoplado. No Adam original, weight decay e adaptação de learning rate se misturavam (o decay era aplicado ao gradiente, não ao peso). AdamW aplica <code>w -= lr * λ * w</code> separadamente, o que produz regularização mais forte e melhor generalização. Todo transformer moderno (BERT, GPT, LLaMA, Stable Diffusion) foi treinado com AdamW.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">class</span> <span class="nc">AdamW</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">lr</span><span class="o">=</span><span class="mf">1e-3</span><span class="p">,</span> <span class="n">betas</span><span class="o">=</span><span class="p">(</span><span class="mf">0.9</span><span class="p">,</span> <span class="mf">0.999</span><span class="p">),</span> <span class="n">eps</span><span class="o">=</span><span class="mf">1e-8</span><span class="p">,</span> <span class="n">weight_decay</span><span class="o">=</span><span class="mf">0.01</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">lr</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">b1</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">b2</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">eps</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">wd</span> <span class="o">=</span> <span class="n">lr</span><span class="p">,</span> <span class="o">*</span><span class="n">betas</span><span class="p">,</span> <span class="n">eps</span><span class="p">,</span> <span class="n">weight_decay</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">m</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">v</span><span class="p">,</span> <span class="bp">self</span><span class="o">.</span><span class="n">t</span> <span class="o">=</span> <span class="p">{},</span> <span class="p">{},</span> <span class="mi">0</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">step</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">params</span><span class="p">,</span> <span class="n">grads</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">t</span> <span class="o">+=</span> <span class="mi">1</span>
</span></span><span class="line"><span class="cl">        <span class="k">for</span> <span class="n">name</span> <span class="ow">in</span> <span class="n">params</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">            <span class="n">p</span><span class="p">,</span> <span class="n">g</span> <span class="o">=</span> <span class="n">params</span><span class="p">[</span><span class="n">name</span><span class="p">],</span> <span class="n">grads</span><span class="p">[</span><span class="n">name</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">            <span class="bp">self</span><span class="o">.</span><span class="n">m</span><span class="p">[</span><span class="n">name</span><span class="p">]</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">b1</span> <span class="o">*</span> <span class="bp">self</span><span class="o">.</span><span class="n">m</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="n">name</span><span class="p">,</span> <span class="mi">0</span><span class="p">)</span> <span class="o">+</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">b1</span><span class="p">)</span> <span class="o">*</span> <span class="n">g</span>
</span></span><span class="line"><span class="cl">            <span class="bp">self</span><span class="o">.</span><span class="n">v</span><span class="p">[</span><span class="n">name</span><span class="p">]</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">b2</span> <span class="o">*</span> <span class="bp">self</span><span class="o">.</span><span class="n">v</span><span class="o">.</span><span class="n">get</span><span class="p">(</span><span class="n">name</span><span class="p">,</span> <span class="mi">0</span><span class="p">)</span> <span class="o">+</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">b2</span><span class="p">)</span> <span class="o">*</span> <span class="n">g</span><span class="o">**</span><span class="mi">2</span>
</span></span><span class="line"><span class="cl">            <span class="n">m_hat</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">m</span><span class="p">[</span><span class="n">name</span><span class="p">]</span> <span class="o">/</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">b1</span><span class="o">**</span><span class="bp">self</span><span class="o">.</span><span class="n">t</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            <span class="n">v_hat</span> <span class="o">=</span> <span class="bp">self</span><span class="o">.</span><span class="n">v</span><span class="p">[</span><span class="n">name</span><span class="p">]</span> <span class="o">/</span> <span class="p">(</span><span class="mi">1</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">b2</span><span class="o">**</span><span class="bp">self</span><span class="o">.</span><span class="n">t</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">            <span class="n">params</span><span class="p">[</span><span class="n">name</span><span class="p">]</span> <span class="o">=</span> <span class="n">p</span> <span class="o">-</span> <span class="bp">self</span><span class="o">.</span><span class="n">lr</span> <span class="o">*</span> <span class="p">(</span><span class="n">m_hat</span> <span class="o">/</span> <span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">v_hat</span><span class="p">)</span> <span class="o">+</span> <span class="bp">self</span><span class="o">.</span><span class="n">eps</span><span class="p">)</span> <span class="o">+</span> <span class="bp">self</span><span class="o">.</span><span class="n">wd</span> <span class="o">*</span> <span class="n">p</span><span class="p">)</span></span></span></code></pre></div>
</div>
<blockquote>
<p><em>Em miúdos:</em> <code>Weight decay</code> é a regularização L2: penalize pesos grandes pra evitar overfitting. <code>Bias correction</code> corrige o viés inicial do Adam: nas primeiras iterações, <code>m</code> e <code>v</code> começam em zero e demoram a aquecer; dividir por <code>(1 - β^t)</code> compensa isso. <code>Beta1=0.9</code> significa &#34;lembre 90% do momentum passado&#34;; <code>beta2=0.999</code> significa &#34;lembre 99.9% da magnitude passada&#34;. <code>Epsilon</code> (1e-8) evita divisão por zero.</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-2">
<h2 id="headline-9">
Fazendo a rede aprender melhor
</h2>
<div id="outline-text-headline-9" class="outline-text-2">
<p>
Os três ingredientes anteriores (ativação, loss, otimizador) são o motor. Os três seguintes são o volante: regularização impede overfitting, inicialização de pesos faz o motor pegar de primeira, e learning rate schedule controla a velocidade na curva.</p>
