blog/content/post/ai-deep-learning.org
** Regularização: o freio que evita decoreba**

Uma rede neural com parâmetros suficientes pode memorizar qualquer dataset. Literalmente: um paper famoso (Zhang et al., 2017) mostrou que redes profundas podem atingir 100% de acurácia em treino com labels aleatórios. Se seu modelo tem 100% no treino e 50% no teste, ele decorou, não aprendeu.

Dropout desliga neurônios aleatoriamente durante o treino (cada neurônio tem probabilidade ~p~ de ser zerado naquela iteração). Isso força a rede a construir representações redundantes, porque nenhum neurônio pode depender de outro estar presente. Na inferência, todos os neurônios participam e a média implícita de muitos submodelos diferentes produz regularização. O dropout padrão do transformer é p=0.1.

BatchNorm normaliza as ativações de cada camada pra média zero e variância um, calculadas sobre o batch atual. Isso acelera o treino (paisagem de loss mais suave), permite learning rates maiores e adiciona um leve ruído que regulariza. Mas depende do tamanho do batch: com batch pequeno, as estatísticas ficam instáveis.

LayerNorm normaliza por amostra em vez de por batch. Calcula média e variância sobre as features de uma única amostra. É o padrão dos transformers porque funciona com batch size 1 e não acopla amostras do batch (importante pra inferência sequencial). RMSNorm é uma LayerNorm sem subtração da média e sem o parâmetro de viés (~β~). A LLaMA e Mistral usam RMSNorm porque é ~10% mais rápida com a mesma qualidade.

#+BEGIN_SRC python
import numpy as np

def layernorm(x, gamma=1.0, beta=0.0, eps=1e-5):
    mean = np.mean(x, axis=-1, keepdims=True)
    var = np.var(x, axis=-1, keepdims=True)
    return gamma * (x - mean) / np.sqrt(var + eps) + beta

def rmsnorm(x, gamma=1.0, eps=1e-5):
    rms = np.sqrt(np.mean(x**2, axis=-1, keepdims=True))
    return gamma * x / (rms + eps)

#+END_SRC

** Inicialização de pesos: por que o primeiro chute importa**

Se todos os pesos começam em zero, todos os neurônios de uma camada são idênticos e produzem o mesmo gradiente. A rede nunca quebra a simetria e não aprende nada.

Se os pesos começam com valores aleatórios na escala errada, o sinal explode (ativações vão pra infinito) ou desaparece (ativações vão pra zero) conforme atravessa as camadas. A matemática: ~Var(z) = fan_in * Var(w) * Var(x)~. Pra manter a variância estável, você precisa de ~Var(w) = 1 / fan_in~.

Xavier (Glorot) inicializa com ~Var(w) = 2 / (fan_in + fan_out)~, otimizada pra sigmoid/tanh. Kaiming (He) inicializa com ~Var(w) = 2 / fan_in~, porque a ReLU zera metade das ativações e você precisa compensar essa perda de variância. O PyTorch usa Kaiming uniforme como padrão no ~nn.Linear~.

O GPT-2 vai além: escala a saída de cada bloco transformer por ~1/√(2 * num_layers)~ antes de somar ao residual. Isso evita que o sinal cresça com a profundidade da rede.

#+BEGIN_SRC python
def kaiming_init(shape, gain=np.sqrt(2)):
    fan_in = shape[1] if len(shape) > 1 else shape[0]
    std = gain / np.sqrt(fan_in)
    return np.random.randn(*shape) * std

def xavier_init(shape):
    fan_in = shape[1] if len(shape) > 1 else shape[0]
    fan_out = shape[0] if len(shape) > 1 else 1
    limit = np.sqrt(6 / (fan_in + fan_out))
    return np.random.uniform(-limit, limit, shape)
#+END_SRC

