ai-deep-learning/index.html
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Regularização: o freio que evita decoreba**
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<p>
Uma rede neural com parâmetros suficientes pode memorizar qualquer dataset. Literalmente: um paper famoso (Zhang et al., 2017) mostrou que redes profundas podem atingir 100% de acurácia em treino com labels aleatórios. Se seu modelo tem 100% no treino e 50% no teste, ele decorou, não aprendeu.</p>
<p>
Dropout desliga neurônios aleatoriamente durante o treino (cada neurônio tem probabilidade <code>p</code> de ser zerado naquela iteração). Isso força a rede a construir representações redundantes, porque nenhum neurônio pode depender de outro estar presente. Na inferência, todos os neurônios participam e a média implícita de muitos submodelos diferentes produz regularização. O dropout padrão do transformer é p=0.1.</p>
<p>
BatchNorm normaliza as ativações de cada camada pra média zero e variância um, calculadas sobre o batch atual. Isso acelera o treino (paisagem de loss mais suave), permite learning rates maiores e adiciona um leve ruído que regulariza. Mas depende do tamanho do batch: com batch pequeno, as estatísticas ficam instáveis.</p>
<p>
LayerNorm normaliza por amostra em vez de por batch. Calcula média e variância sobre as features de uma única amostra. É o padrão dos transformers porque funciona com batch size 1 e não acopla amostras do batch (importante pra inferência sequencial). RMSNorm é uma LayerNorm sem subtração da média e sem o parâmetro de viés (<code>β</code>). A LLaMA e Mistral usam RMSNorm porque é ~10% mais rápida com a mesma qualidade.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">numpy</span> <span class="k">as</span> <span class="nn">np</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">layernorm</span><span class="p">(</span><span class="n">x</span><span class="p">,</span> <span class="n">gamma</span><span class="o">=</span><span class="mf">1.0</span><span class="p">,</span> <span class="n">beta</span><span class="o">=</span><span class="mf">0.0</span><span class="p">,</span> <span class="n">eps</span><span class="o">=</span><span class="mf">1e-5</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">mean</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">mean</span><span class="p">(</span><span class="n">x</span><span class="p">,</span> <span class="n">axis</span><span class="o">=-</span><span class="mi">1</span><span class="p">,</span> <span class="n">keepdims</span><span class="o">=</span><span class="kc">True</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">var</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">var</span><span class="p">(</span><span class="n">x</span><span class="p">,</span> <span class="n">axis</span><span class="o">=-</span><span class="mi">1</span><span class="p">,</span> <span class="n">keepdims</span><span class="o">=</span><span class="kc">True</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">gamma</span> <span class="o">*</span> <span class="p">(</span><span class="n">x</span> <span class="o">-</span> <span class="n">mean</span><span class="p">)</span> <span class="o">/</span> <span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">var</span> <span class="o">+</span> <span class="n">eps</span><span class="p">)</span> <span class="o">+</span> <span class="n">beta</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">rmsnorm</span><span class="p">(</span><span class="n">x</span><span class="p">,</span> <span class="n">gamma</span><span class="o">=</span><span class="mf">1.0</span><span class="p">,</span> <span class="n">eps</span><span class="o">=</span><span class="mf">1e-5</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">rms</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">mean</span><span class="p">(</span><span class="n">x</span><span class="o">**</span><span class="mi">2</span><span class="p">,</span> <span class="n">axis</span><span class="o">=-</span><span class="mi">1</span><span class="p">,</span> <span class="n">keepdims</span><span class="o">=</span><span class="kc">True</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">gamma</span> <span class="o">*</span> <span class="n">x</span> <span class="o">/</span> <span class="p">(</span><span class="n">rms</span> <span class="o">+</span> <span class="n">eps</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Inicialização de pesos: por que o primeiro chute importa**
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>
Se todos os pesos começam em zero, todos os neurônios de uma camada são idênticos e produzem o mesmo gradiente. A rede nunca quebra a simetria e não aprende nada.</p>
<p>
Se os pesos começam com valores aleatórios na escala errada, o sinal explode (ativações vão pra infinito) ou desaparece (ativações vão pra zero) conforme atravessa as camadas. A matemática: <code>Var(z) = fan_in * Var(w) * Var(x)</code>. Pra manter a variância estável, você precisa de <code>Var(w) = 1 / fan_in</code>.</p>
<p>
Xavier (Glorot) inicializa com <code>Var(w) = 2 / (fan_in + fan_out)</code>, otimizada pra sigmoid/tanh. Kaiming (He) inicializa com <code>Var(w) = 2 / fan_in</code>, porque a ReLU zera metade das ativações e você precisa compensar essa perda de variância. O PyTorch usa Kaiming uniforme como padrão no <code>nn.Linear</code>.</p>
<p>
O GPT-2 vai além: escala a saída de cada bloco transformer por <code>1/√(2 * num_layers)</code> antes de somar ao residual. Isso evita que o sinal cresça com a profundidade da rede.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">kaiming_init</span><span class="p">(</span><span class="n">shape</span><span class="p">,</span> <span class="n">gain</span><span class="o">=</span><span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="mi">2</span><span class="p">)):</span>
</span></span><span class="line"><span class="cl">    <span class="n">fan_in</span> <span class="o">=</span> <span class="n">shape</span><span class="p">[</span><span class="mi">1</span><span class="p">]</span> <span class="k">if</span> <span class="nb">len</span><span class="p">(</span><span class="n">shape</span><span class="p">)</span> <span class="o">&gt;</span> <span class="mi">1</span> <span class="k">else</span> <span class="n">shape</span><span class="p">[</span><span class="mi">0</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="n">std</span> <span class="o">=</span> <span class="n">gain</span> <span class="o">/</span> <span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="n">fan_in</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">randn</span><span class="p">(</span><span class="o">*</span><span class="n">shape</span><span class="p">)</span> <span class="o">*</span> <span class="n">std</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">xavier_init</span><span class="p">(</span><span class="n">shape</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="n">fan_in</span> <span class="o">=</span> <span class="n">shape</span><span class="p">[</span><span class="mi">1</span><span class="p">]</span> <span class="k">if</span> <span class="nb">len</span><span class="p">(</span><span class="n">shape</span><span class="p">)</span> <span class="o">&gt;</span> <span class="mi">1</span> <span class="k">else</span> <span class="n">shape</span><span class="p">[</span><span class="mi">0</span><span class="p">]</span>
</span></span><span class="line"><span class="cl">    <span class="n">fan_out</span> <span class="o">=</span> <span class="n">shape</span><span class="p">[</span><span class="mi">0</span><span class="p">]</span> <span class="k">if</span> <span class="nb">len</span><span class="p">(</span><span class="n">shape</span><span class="p">)</span> <span class="o">&gt;</span> <span class="mi">1</span> <span class="k">else</span> <span class="mi">1</span>
</span></span><span class="line"><span class="cl">    <span class="n">limit</span> <span class="o">=</span> <span class="n">np</span><span class="o">.</span><span class="n">sqrt</span><span class="p">(</span><span class="mi">6</span> <span class="o">/</span> <span class="p">(</span><span class="n">fan_in</span> <span class="o">+</span> <span class="n">fan_out</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">np</span><span class="o">.</span><span class="n">random</span><span class="o">.</span><span class="n">uniform</span><span class="p">(</span><span class="o">-</span><span class="n">limit</span><span class="p">,</span> <span class="n">limit</span><span class="p">,</span> <span class="n">shape</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
