blog/content/post/ai-deep-learning.org
** Learning rate schedules: a arte de dosar a velocidade**

O learning rate é o hiperparâmetro mais importante. Constante raramente é ótimo: você quer passos grandes no começo (explorar) e pequenos no fim (refinar). A diferença entre o melhor e o segundo melhor schedule pode ser vários pontos percentuais de acurácia.

Warmup resolve o problema do Adam nas primeiras iterações: como ~m~ e ~v~ começam em zero, as estimativas iniciais são ruidosas. Warmup sobe o learning rate gradualmente de ~lr/25~ até o valor alvo nos primeiros 3-5% dos passos. Todo transformer grande usa warmup (LLaMA 3: 2000 passos de warmup).

Cosine decay desce suavemente do pico até quase zero: ~lr(t) = lr_min + 0.5 * (lr_max - lr_min) * (1 + cos(π * t / T))~. É o padrão moderno pra transformers. Step decay (cai 10x a cada N épocas) ainda funciona bem pra CNNs com SGD.

A política 1cycle (Smith, 2018) sobe o learning rate na primeira metade do treino e desce na segunda. A intuição: learning rates altos no meio do treino regularizam (jogam o modelo pra regiões mais planas da paisagem de loss, que generalizam melhor). Pra orçamentos fixos de compute, 1cycle frequentemente bate cosine.

#+BEGIN_SRC python
def cosine_schedule(step, total_steps, lr_max=1e-3, lr_min=1e-5):
    return lr_min + 0.5 * (lr_max - lr_min) * (1 + np.cos(np.pi * step / total_steps))

def warmup_cosine(step, warmup_steps, total_steps, lr_max=1e-3, lr_min=1e-5):
    if step < warmup_steps:
        return lr_max * step / warmup_steps
    return cosine_schedule(step - warmup_steps, total_steps - warmup_steps, lr_max, lr_min)
#+END_SRC

* Do zero ao framework

As 9 peças anteriores formam um mecanismo completo. Juntando tudo, você consegue construir um mini-framework de deep learning em ~500 linhas.

** Construindo seu próprio PyTorch**

A abstração central é o ~Module~. Ele tem ~forward()~ (computar predições), ~backward()~ (calcular gradientes), ~parameters()~ (devolver todos os pesos ajustáveis) e ~train()/eval()~ (ligar/desligar dropout e batch norm). Toda camada da rede herda de Module.

O ~Linear~ é um Module que guarda uma matriz de pesos ~W~ e um vetor de vieses ~b~. O forward é ~W @ x + b~. No backward, você recebe o gradiente da camada seguinte e calcula os gradientes locais (pra atualizar W e b) e o gradiente pra propagar pra camada anterior.

O ~Sequential~ é um container que empilha módulos e chama o forward de cada um em sequência. O backward percorre a lista de trás pra frente (porque gradiente flui da saída pra entrada).

#+BEGIN_SRC python
class Module:
    def forward(self, x): raise NotImplementedError
    def backward(self, grad): raise NotImplementedError
    def parameters(self): return []
    def train(self): pass
    def eval(self): pass

class Sequential(Module):
    def __init__(self, *modules):
        self.modules = modules
    def forward(self, x):
        for m in self.modules: x = m.forward(x)
        return x
    def backward(self, grad):
        for m in reversed(self.modules): grad = m.backward(grad)
        return grad
    def parameters(self):
        return [p for m in self.modules for p in m.parameters()]
#+END_SRC

O loop de treino é sempre o mesmo, seja seu framework de 500 linhas ou o PyTorch treinando GPT-4:

#+BEGIN_SRC python
for epoch in range(epochs):
    for x_batch, y_batch in dataloader:
        optimizer.zero_grad()          # zera gradientes acumulados
        y_pred = model.forward(x_batch) # forward pass
        loss = loss_fn(y_pred, y_batch) # calcula erro
        loss.backward()                 # backpropagation
        optimizer.step()                # atualiza pesos
#+END_SRC

