ai-deep-learning/index.html
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
Learning rate schedules: a arte de dosar a velocidade**
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>
O learning rate é o hiperparâmetro mais importante. Constante raramente é ótimo: você quer passos grandes no começo (explorar) e pequenos no fim (refinar). A diferença entre o melhor e o segundo melhor schedule pode ser vários pontos percentuais de acurácia.</p>
<p>
Warmup resolve o problema do Adam nas primeiras iterações: como <code>m</code> e <code>v</code> começam em zero, as estimativas iniciais são ruidosas. Warmup sobe o learning rate gradualmente de <code>lr/25</code> até o valor alvo nos primeiros 3-5% dos passos. Todo transformer grande usa warmup (LLaMA 3: 2000 passos de warmup).</p>
<p>
Cosine decay desce suavemente do pico até quase zero: <code>lr(t) = lr_min + 0.5 * (lr_max - lr_min) * (1 + cos(π * t / T))</code>. É o padrão moderno pra transformers. Step decay (cai 10x a cada N épocas) ainda funciona bem pra CNNs com SGD.</p>
<p>
A política 1cycle (Smith, 2018) sobe o learning rate na primeira metade do treino e desce na segunda. A intuição: learning rates altos no meio do treino regularizam (jogam o modelo pra regiões mais planas da paisagem de loss, que generalizam melhor). Pra orçamentos fixos de compute, 1cycle frequentemente bate cosine.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">cosine_schedule</span><span class="p">(</span><span class="n">step</span><span class="p">,</span> <span class="n">total_steps</span><span class="p">,</span> <span class="n">lr_max</span><span class="o">=</span><span class="mf">1e-3</span><span class="p">,</span> <span class="n">lr_min</span><span class="o">=</span><span class="mf">1e-5</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">lr_min</span> <span class="o">+</span> <span class="mf">0.5</span> <span class="o">*</span> <span class="p">(</span><span class="n">lr_max</span> <span class="o">-</span> <span class="n">lr_min</span><span class="p">)</span> <span class="o">*</span> <span class="p">(</span><span class="mi">1</span> <span class="o">+</span> <span class="n">np</span><span class="o">.</span><span class="n">cos</span><span class="p">(</span><span class="n">np</span><span class="o">.</span><span class="n">pi</span> <span class="o">*</span> <span class="n">step</span> <span class="o">/</span> <span class="n">total_steps</span><span class="p">))</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">def</span> <span class="nf">warmup_cosine</span><span class="p">(</span><span class="n">step</span><span class="p">,</span> <span class="n">warmup_steps</span><span class="p">,</span> <span class="n">total_steps</span><span class="p">,</span> <span class="n">lr_max</span><span class="o">=</span><span class="mf">1e-3</span><span class="p">,</span> <span class="n">lr_min</span><span class="o">=</span><span class="mf">1e-5</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="k">if</span> <span class="n">step</span> <span class="o">&lt;</span> <span class="n">warmup_steps</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="k">return</span> <span class="n">lr_max</span> <span class="o">*</span> <span class="n">step</span> <span class="o">/</span> <span class="n">warmup_steps</span>
</span></span><span class="line"><span class="cl">    <span class="k">return</span> <span class="n">cosine_schedule</span><span class="p">(</span><span class="n">step</span> <span class="o">-</span> <span class="n">warmup_steps</span><span class="p">,</span> <span class="n">total_steps</span> <span class="o">-</span> <span class="n">warmup_steps</span><span class="p">,</span> <span class="n">lr_max</span><span class="p">,</span> <span class="n">lr_min</span><span class="p">)</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-13" class="outline-2">
<h2 id="headline-13">
Do zero ao framework
</h2>
<div id="outline-text-headline-13" class="outline-text-2">
<p>
As 9 peças anteriores formam um mecanismo completo. Juntando tudo, você consegue construir um mini-framework de deep learning em ~500 linhas.</p>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
Construindo seu próprio PyTorch**
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<p>
A abstração central é o <code>Module</code>. Ele tem <code>forward()</code> (computar predições), <code>backward()</code> (calcular gradientes), <code>parameters()</code> (devolver todos os pesos ajustáveis) e <code>train()/eval()</code> (ligar/desligar dropout e batch norm). Toda camada da rede herda de Module.</p>
<p>
O <code>Linear</code> é um Module que guarda uma matriz de pesos <code>W</code> e um vetor de vieses <code>b</code>. O forward é <code>W @ x + b</code>. No backward, você recebe o gradiente da camada seguinte e calcula os gradientes locais (pra atualizar W e b) e o gradiente pra propagar pra camada anterior.</p>
<p>
O <code>Sequential</code> é um container que empilha módulos e chama o forward de cada um em sequência. O backward percorre a lista de trás pra frente (porque gradiente flui da saída pra entrada).</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">class</span> <span class="nc">Module</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">forward</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">x</span><span class="p">):</span> <span class="k">raise</span> <span class="ne">NotImplementedError</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">backward</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">grad</span><span class="p">):</span> <span class="k">raise</span> <span class="ne">NotImplementedError</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">parameters</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span> <span class="k">return</span> <span class="p">[]</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">train</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span> <span class="k">pass</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">eval</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span> <span class="k">pass</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">class</span> <span class="nc">Sequential</span><span class="p">(</span><span class="n">Module</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="fm">__init__</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="o">*</span><span class="n">modules</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="bp">self</span><span class="o">.</span><span class="n">modules</span> <span class="o">=</span> <span class="n">modules</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">forward</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">x</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="k">for</span> <span class="n">m</span> <span class="ow">in</span> <span class="bp">self</span><span class="o">.</span><span class="n">modules</span><span class="p">:</span> <span class="n">x</span> <span class="o">=</span> <span class="n">m</span><span class="o">.</span><span class="n">forward</span><span class="p">(</span><span class="n">x</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="k">return</span> <span class="n">x</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">backward</span><span class="p">(</span><span class="bp">self</span><span class="p">,</span> <span class="n">grad</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="k">for</span> <span class="n">m</span> <span class="ow">in</span> <span class="nb">reversed</span><span class="p">(</span><span class="bp">self</span><span class="o">.</span><span class="n">modules</span><span class="p">):</span> <span class="n">grad</span> <span class="o">=</span> <span class="n">m</span><span class="o">.</span><span class="n">backward</span><span class="p">(</span><span class="n">grad</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">        <span class="k">return</span> <span class="n">grad</span>
</span></span><span class="line"><span class="cl">    <span class="k">def</span> <span class="nf">parameters</span><span class="p">(</span><span class="bp">self</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">        <span class="k">return</span> <span class="p">[</span><span class="n">p</span> <span class="k">for</span> <span class="n">m</span> <span class="ow">in</span> <span class="bp">self</span><span class="o">.</span><span class="n">modules</span> <span class="k">for</span> <span class="n">p</span> <span class="ow">in</span> <span class="n">m</span><span class="o">.</span><span class="n">parameters</span><span class="p">()]</span></span></span></code></pre></div>
</div>
<p>
O loop de treino é sempre o mesmo, seja seu framework de 500 linhas ou o PyTorch treinando GPT-4:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="k">for</span> <span class="n">epoch</span> <span class="ow">in</span> <span class="nb">range</span><span class="p">(</span><span class="n">epochs</span><span class="p">):</span>
</span></span><span class="line"><span class="cl">    <span class="k">for</span> <span class="n">x_batch</span><span class="p">,</span> <span class="n">y_batch</span> <span class="ow">in</span> <span class="n">dataloader</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="n">optimizer</span><span class="o">.</span><span class="n">zero_grad</span><span class="p">()</span>          <span class="c1"># zera gradientes acumulados</span>
</span></span><span class="line"><span class="cl">        <span class="n">y_pred</span> <span class="o">=</span> <span class="n">model</span><span class="o">.</span><span class="n">forward</span><span class="p">(</span><span class="n">x_batch</span><span class="p">)</span> <span class="c1"># forward pass</span>
</span></span><span class="line"><span class="cl">        <span class="n">loss</span> <span class="o">=</span> <span class="n">loss_fn</span><span class="p">(</span><span class="n">y_pred</span><span class="p">,</span> <span class="n">y_batch</span><span class="p">)</span> <span class="c1"># calcula erro</span>
</span></span><span class="line"><span class="cl">        <span class="n">loss</span><span class="o">.</span><span class="n">backward</span><span class="p">()</span>                 <span class="c1"># backpropagation</span>
</span></span><span class="line"><span class="cl">        <span class="n">optimizer</span><span class="o">.</span><span class="n">step</span><span class="p">()</span>                <span class="c1"># atualiza pesos</span></span></span></code></pre></div>
</div>
</div>
</div>
