blog/content/post/ai-deep-learning.org
** PyTorch: o framework que ganhou**

Seu mini-framework é 500x mais lento que o PyTorch. O PyTorch faz tudo que você construiu, mas com autograd (não precisa escrever backward manual), GPU (troque ~cpu~ por ~cuda~), mixed precision (float16 onde pode, float32 onde precisa) e um ecossistema que vai do ~torchvision~ ao ~torch.distributed~.

A API do PyTorch mapeia 1:1 pro que você construiu: ~nn.Module~ é seu Module. ~nn.Linear~ é seu Linear. ~nn.Sequential~ é seu Sequential. ~optim.AdamW~ é seu AdamW. A diferença é que o PyTorch compila o grafo computacional em C++ e manda pra GPU.

O loop canônico de 5 linhas treinou todos os modelos que você já ouviu falar:

#+BEGIN_SRC python
import torch
import torch.nn as nn
import torch.optim as optim

model = nn.Sequential(nn.Linear(784, 256), nn.ReLU(), nn.Linear(256, 10))
criterion = nn.CrossEntropyLoss()
optimizer = optim.AdamW(model.parameters(), lr=1e-3)

for x, y in dataloader:
    optimizer.zero_grad()
    loss = criterion(model(x), y)
    loss.backward()
    optimizer.step()
#+END_SRC

** JAX: o primo funcional**

JAX adota uma filosofia oposta. Em vez de objetos mutáveis com estado interno (como ~model.parameters()~ que são atualizados in-place), JAX exige funções puras. Você escreve ~def loss_fn(params, x, y)~, e o JAX te dá ~grad(loss_fn)~, ~jit(loss_fn)~ e ~vmap(loss_fn)~ de graça.

A imutabilidade é a chave: como nada é modificado in-place, o JAX pode traçar o grafo inteiro da computação e compilar pra XLA (Acelerador Linear Algebra), que funde operações e elimina overhead de Python. O resultado é 10-100x mais rápido em hardware acelerado (TPU especialmente).

Quem usa JAX: Google DeepMind (Gemini), Anthropic (Claude). Vale a pena se você tem TPU, precisa de gradientes por amostra (~per-example gradients~) ou treina em escala massiva com múltiplos dispositivos. Pra todo o resto, PyTorch.

#+BEGIN_SRC python
# Em JAX, o treino é uma função pura que retorna novos parâmetros:
# @jax.jit
# def train_step(params, opt_state, x, y):
#     loss, grads = jax.value_and_grad(loss_fn)(params, x, y)
#     updates, opt_state = optimizer.update(grads, opt_state, params)
#     params = optax.apply_updates(params, updates)
#     return params, opt_state, loss
#+END_SRC

* Debugging: quando a rede não quebra, mas também não aprende

Rede neural quebrada não dá erro. Ela treina por horas, a loss desce (ou não), você olha a acurácia no teste e descobre que seu modelo aprendeu a chutar a classe majoritária. Ou aprendeu a decorar o dataset. Ou simplesmente não converge. E não tem stack trace.

60 a 70% do tempo de debugging em ML é gasto em bugs silenciosos. Existe um protocolo.

** Overfit num batch**

O teste mais importante de todos. Pegue um único batch de 32 exemplos. Treine por 100 iterações. Se a loss não chegar perto de zero e a acurácia não for 100%, seu modelo tem um bug estrutural (shape errado, gradiente quebrado, loss errada). Não prossiga antes de passar nesse teste.

** Gradient checking**

Compare o gradiente analítico (calculado pelo backprop) com o numérico (perturbe cada peso em ε, meça a diferença na loss). Se a diferença relativa for maior que 1e-5, seu backward tem um erro de implementação.

** Estatísticas de ativação**

Registre média, desvio padrão e fração de zeros das ativações de cada camada. Se a média está crescendo exponencialmente com a profundidade, os pesos estão mal inicializados. Se mais de 50% das ativações ReLU são zero, você tem neurônios mortos.

** Gradiente por camada**

Registre média e máximo do gradiente absoluto por camada. Se as primeiras camadas têm gradiente próximo de zero e as últimas têm gradiente normal, você tem vanishing gradients (troque sigmoid por ReLU/GELU ou adicione skip connections). Se os gradientes são NaN ou Inf, reduza o learning rate em 10x.

