ai-deep-learning/index.html
<div id="outline-container-headline-15" class="outline-3">
<h3 id="headline-15">
PyTorch: o framework que ganhou**
</h3>
<div id="outline-text-headline-15" class="outline-text-3">
<p>
Seu mini-framework é 500x mais lento que o PyTorch. O PyTorch faz tudo que você construiu, mas com autograd (não precisa escrever backward manual), GPU (troque <code>cpu</code> por <code>cuda</code>), mixed precision (float16 onde pode, float32 onde precisa) e um ecossistema que vai do <code>torchvision</code> ao <code>torch.distributed</code>.</p>
<p>
A API do PyTorch mapeia 1:1 pro que você construiu: <code>nn.Module</code> é seu Module. <code>nn.Linear</code> é seu Linear. <code>nn.Sequential</code> é seu Sequential. <code>optim.AdamW</code> é seu AdamW. A diferença é que o PyTorch compila o grafo computacional em C++ e manda pra GPU.</p>
<p>
O loop canônico de 5 linhas treinou todos os modelos que você já ouviu falar:</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">torch</span>
</span></span><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">torch.nn</span> <span class="k">as</span> <span class="nn">nn</span>
</span></span><span class="line"><span class="cl"><span class="kn">import</span> <span class="nn">torch.optim</span> <span class="k">as</span> <span class="nn">optim</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="n">model</span> <span class="o">=</span> <span class="n">nn</span><span class="o">.</span><span class="n">Sequential</span><span class="p">(</span><span class="n">nn</span><span class="o">.</span><span class="n">Linear</span><span class="p">(</span><span class="mi">784</span><span class="p">,</span> <span class="mi">256</span><span class="p">),</span> <span class="n">nn</span><span class="o">.</span><span class="n">ReLU</span><span class="p">(),</span> <span class="n">nn</span><span class="o">.</span><span class="n">Linear</span><span class="p">(</span><span class="mi">256</span><span class="p">,</span> <span class="mi">10</span><span class="p">))</span>
</span></span><span class="line"><span class="cl"><span class="n">criterion</span> <span class="o">=</span> <span class="n">nn</span><span class="o">.</span><span class="n">CrossEntropyLoss</span><span class="p">()</span>
</span></span><span class="line"><span class="cl"><span class="n">optimizer</span> <span class="o">=</span> <span class="n">optim</span><span class="o">.</span><span class="n">AdamW</span><span class="p">(</span><span class="n">model</span><span class="o">.</span><span class="n">parameters</span><span class="p">(),</span> <span class="n">lr</span><span class="o">=</span><span class="mf">1e-3</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl"><span class="k">for</span> <span class="n">x</span><span class="p">,</span> <span class="n">y</span> <span class="ow">in</span> <span class="n">dataloader</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">    <span class="n">optimizer</span><span class="o">.</span><span class="n">zero_grad</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">    <span class="n">loss</span> <span class="o">=</span> <span class="n">criterion</span><span class="p">(</span><span class="n">model</span><span class="p">(</span><span class="n">x</span><span class="p">),</span> <span class="n">y</span><span class="p">)</span>
</span></span><span class="line"><span class="cl">    <span class="n">loss</span><span class="o">.</span><span class="n">backward</span><span class="p">()</span>
</span></span><span class="line"><span class="cl">    <span class="n">optimizer</span><span class="o">.</span><span class="n">step</span><span class="p">()</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-16" class="outline-3">
<h3 id="headline-16">
JAX: o primo funcional**
</h3>
<div id="outline-text-headline-16" class="outline-text-3">
<p>
JAX adota uma filosofia oposta. Em vez de objetos mutáveis com estado interno (como <code>model.parameters()</code> que são atualizados in-place), JAX exige funções puras. Você escreve <code>def loss_fn(params, x, y)</code>, e o JAX te dá <code>grad(loss_fn)</code>, <code>jit(loss_fn)</code> e <code>vmap(loss_fn)</code> de graça.</p>
<p>
A imutabilidade é a chave: como nada é modificado in-place, o JAX pode traçar o grafo inteiro da computação e compilar pra XLA (Acelerador Linear Algebra), que funde operações e elimina overhead de Python. O resultado é 10-100x mais rápido em hardware acelerado (TPU especialmente).</p>
<p>
Quem usa JAX: Google DeepMind (Gemini), Anthropic (Claude). Vale a pena se você tem TPU, precisa de gradientes por amostra (<code>per-example gradients</code>) ou treina em escala massiva com múltiplos dispositivos. Pra todo o resto, PyTorch.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" class="chroma"><code class="language-python" data-lang="python"><span class="line"><span class="cl"><span class="c1"># Em JAX, o treino é uma função pura que retorna novos parâmetros:</span>
</span></span><span class="line"><span class="cl"><span class="c1"># @jax.jit</span>
</span></span><span class="line"><span class="cl"><span class="c1"># def train_step(params, opt_state, x, y):</span>
</span></span><span class="line"><span class="cl"><span class="c1">#     loss, grads = jax.value_and_grad(loss_fn)(params, x, y)</span>
</span></span><span class="line"><span class="cl"><span class="c1">#     updates, opt_state = optimizer.update(grads, opt_state, params)</span>
</span></span><span class="line"><span class="cl"><span class="c1">#     params = optax.apply_updates(params, updates)</span>
</span></span><span class="line"><span class="cl"><span class="c1">#     return params, opt_state, loss</span></span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-17" class="outline-2">
<h2 id="headline-17">
Debugging: quando a rede não quebra, mas também não aprende
</h2>
<div id="outline-text-headline-17" class="outline-text-2">
<p>
Rede neural quebrada não dá erro. Ela treina por horas, a loss desce (ou não), você olha a acurácia no teste e descobre que seu modelo aprendeu a chutar a classe majoritária. Ou aprendeu a decorar o dataset. Ou simplesmente não converge. E não tem stack trace.</p>
<p>
60 a 70% do tempo de debugging em ML é gasto em bugs silenciosos. Existe um protocolo.</p>
<div id="outline-container-headline-18" class="outline-3">
<h3 id="headline-18">
Overfit num batch**
</h3>
<div id="outline-text-headline-18" class="outline-text-3">
<p>
O teste mais importante de todos. Pegue um único batch de 32 exemplos. Treine por 100 iterações. Se a loss não chegar perto de zero e a acurácia não for 100%, seu modelo tem um bug estrutural (shape errado, gradiente quebrado, loss errada). Não prossiga antes de passar nesse teste.</p>
</div>
</div>
<div id="outline-container-headline-19" class="outline-3">
<h3 id="headline-19">
Gradient checking**
</h3>
<div id="outline-text-headline-19" class="outline-text-3">
<p>
Compare o gradiente analítico (calculado pelo backprop) com o numérico (perturbe cada peso em ε, meça a diferença na loss). Se a diferença relativa for maior que 1e-5, seu backward tem um erro de implementação.</p>
</div>
</div>
<div id="outline-container-headline-20" class="outline-3">
<h3 id="headline-20">
Estatísticas de ativação**
</h3>
<div id="outline-text-headline-20" class="outline-text-3">
<p>
Registre média, desvio padrão e fração de zeros das ativações de cada camada. Se a média está crescendo exponencialmente com a profundidade, os pesos estão mal inicializados. Se mais de 50% das ativações ReLU são zero, você tem neurônios mortos.</p>
</div>
</div>
<div id="outline-container-headline-21" class="outline-3">
<h3 id="headline-21">
Gradiente por camada**
</h3>
<div id="outline-text-headline-21" class="outline-text-3">
<p>
Registre média e máximo do gradiente absoluto por camada. Se as primeiras camadas têm gradiente próximo de zero e as últimas têm gradiente normal, você tem vanishing gradients (troque sigmoid por ReLU/GELU ou adicione skip connections). Se os gradientes são NaN ou Inf, reduza o learning rate em 10x.</p>
</div>
</div>
